Repository: ldrfy/lfy
Catalog: po/*.po
Languages: pt_br

source: Automatically check the new version of the software upon startup
pt_br: Verifique automaticamente a nova versão do software na inicialização

source: Copy to Translate
pt_br: Copiar para traduzir

source: After the translation is completed, a system notification is automatically sent
pt_br: Após a conclusão da tradução, uma notificação do sistema é enviada automaticamente

source: theme
pt_br: Tema

source: The currently selected OCR service
pt_br: O serviço de OCR atualmente selecionado

source: The currently selected translation service
pt_br: O serviço de tradução atualmente selecionado

source: Translation windows width
pt_br: Largura das janelas de tradução

source: Translation windows height
pt_br: Altura das janelas de tradução

source: Baidu app_id and secret_key, used in the middle | split
pt_br: Baidu app_id e secret_key, usados ​​na divisão intermediária

source: Baidu API Key and Secret Key for ocr, used in the middle | split
pt_br: Chave de API do Baidu e chave secreta para ocr, usadas na divisão intermediária

source: The lang parameters of the pytesseract module, such as Chinese and English by default
pt_br: Os parâmetros lang do módulo pytesseract, como chinês e inglês por padrão

source: The lang parameters of the easyocr module, such as Chinese and English by default, split by +
pt_br: Os parâmetros de idioma do módulo easyocr, como chinês e inglês por padrão, são separados por +

source: Baidu OCR access_token
pt_br: Token de acesso OCR do Baidu

source: Baidu OCR access_token expires date
pt_br: Data de expiração do access_token do Baidu OCR

source: aliyun AccessKey ID and AccessKey Secret, used in the middle | split
pt_br: ID da Chave de Acesso e Segredo da Chave de Acesso do Aliyun, usados no meio | dividir

source: huoshan Access Key ID and Secret Access Key, used in the middle | split
pt_br: ID da Chave de Acesso e Chave de Acesso Secreta do Huoshan, usados no meio | dividir

source: Tencent secret_id and secret_key, used in the middle | split
pt_br: secret_id e secret_key da Tencent, usados no meio | dividir

source: VPN address and port
pt_br: Endereço e porta VPN

source: Which services are available in compare model
pt_br: Quais serviços estão disponíveis no modelo de comparação

source: Translation software designed for reading scientific research literature
pt_br: Software de tradução projetado para leitura de literatura de pesquisa científica

source: An easy and pleasant way to translate. Support many translation services. Especially suitable for document translation.
pt_br: Uma maneira fácil e agradável de traduzir. Apoie muitos serviços de tradução. Especialmente adequado para tradução de documentos.

source: Translation homepage
pt_br: Página inicial de tradução

source: Preferences page
pt_br: Página de preferências

source: Set Api Key
pt_br: Definir chave API

source: Shortcuts
pt_br: Atalhos

source: About
pt_br: Sobre

source: The native qt version of plasma can be installed by `pip install lfy`
pt_br: A versão qt nativa do plasma pode ser instalada por `pip install lfy`

source: Add local OCR recognition: easyocr, pytesseract (not support flatpak)
pt_br: Adicione o reconhecimento local do OCR: Easyocr, Pytesseract (não suporta Flatpak)

source: Add import and export settings
pt_br: Adicionar configurações de importação e exportação

source: Add translate or OCR in terminal, like `lfy -h`
pt_br: Adicione tradução ou OCR no terminal, como `lfy -h`

source: Add debug in about page
pt_br: Adicionar depuração na página sobre

source: Add the dividing line in the middle of the translation page
pt_br: Adicione a linha divisória no meio da página de tradução

source: Refactor settings page
pt_br: Página de configurações de refatoração

source: Add aliyun/huoshan Translate for free
pt_br: Adicione informações adicionais Traduza gratuitamente

source: Support notification after translation
pt_br: Notificação de suporte após tradução

source: Supports comparing multiple translations at the same time
pt_br: Suporta comparação de múltiplas traduções ao mesmo tempo

source: Add Bing Translate for free
pt_br: Adicione o Bing Translate gratuitamente

source: Fix Google Translate
pt_br: Corrigir o Google Tradutor

source: Improve translation performance
pt_br: Melhore o desempenho da tradução

source: Add Italian language and support Italian translation
pt_br: Adicione o idioma italiano e suporte à tradução para italiano

source: Optimize the structure of translation services and make it more convenient to create third-party translation services
pt_br: Otimizar a estrutura dos serviços de tradução e tornar mais conveniente criar serviços de tradução de terceiros

source: add shortcut
pt_br: adicionar atalho

source: Automatically check for updates
pt_br: Verifique automaticamente se há atualizações

source: Basic functions completed
pt_br: Funções básicas concluídas

source: This time the content contains private information and is not translated
pt_br: Desta vez, o conteúdo contém informações privadas e não é traduzido

source: translator_credits
pt_br: John peter sa <johnppetersa@gmail.com>

source: Copy detected, translate immediately
pt_br: Cópia detectada, traduza imediatamente

source: Copy detected, not automatically translated
pt_br: Cópia detectada, não traduzida automaticamente

source: Next translation not remove line breaks
pt_br: Próxima tradução não remove quebras de linha

source: Next translation remove line breaks
pt_br: Próxima tradução remover quebras de linha

source: Next translation without splicing text
pt_br: Próxima tradução sem emendar texto

source: Next translation splicing text
pt_br: Próxima tradução emendando texto

source: compare
pt_br: comparar

source: It takes effect when you restart lfy
pt_br: Entra em vigor quando você reinicia o lfy

source: The clipboard format is incorrect
pt_br: O formato da área de transferência está incorreto

source: Configuration data has been exported to the clipboard
pt_br: Os dados de configuração foram exportados para a área de transferência

source: Using {} for text recognition
pt_br: Usando {} para reconhecimento de texto

source: Text translate
pt_br: Tradução de texto

source: Text recognition
pt_br: Reconhecimento de texto

source: error message
pt_br: mensagem de erro

source: Confirm
pt_br: Confirmar

source: General
pt_br: Em geral

source: Other
pt_br: Outro

source: Translation keys
pt_br: Chaves de tradução

source: how to get API Key
pt_br: como obter a chave API

source: Save
pt_br: Salvar

source: OCR server
pt_br: Servidor OCR

source: auto check update
pt_br: atualização de verificação automática

source: Notify translation results
pt_br: Notificar resultados de tradução

source: Compare model
pt_br: Comparar modelo

source: vpn addr and port
pt_br: endereço e porta VPN

source: Software settings backup and restore
pt_br: Backup e restauração de configurações de software

source: Read the JSON configuration of the clipboard, then import it, and some of the configurations will take effect after reopening the software
pt_br: Leia a configuração JSON da área de transferência, importe-a e algumas das configurações terão efeito após reabrir o software

source: restore
pt_br: restaurar

source: Export the configuration to the clipboard, then you can paste it into any file and edit it
pt_br: Exporte a configuração para a área de transferência, então você poderá colá-la em qualquer arquivo e editá-la

source: Import successful!
pt_br: Importação bem-sucedida!

source: It takes effect when you restart lfy.
pt_br: Ele entra em vigor quando você reinicia o lfy.

source: Import failed!
pt_br: Falha na importação!

source: No configuration data in the clipboard.
pt_br: Nenhum dado de configuração na área de transferência.

source: Export successful!
pt_br: Exportação bem-sucedida!

source: Configuration data has been exported to the clipboard.
pt_br: Os dados de configuração foram exportados para a área de transferência.

source: Remove line breaks
pt_br: Remover quebras de linha

source: Alt + D: Remove symbols such as line breaks
pt_br: Alt + D: Remova símbolos como quebras de linha

source: Splice Text
pt_br: Emendar texto

source: Alt + C: Splice the next copied text with the previous text
pt_br: Alt + C: Une o próximo texto copiado com o texto anterior

source: Translate
pt_br: Traduzir

source: Select text and use the shortcut key '{}' to copy, the copied text will not be automatically translated
pt_br: Selecione o texto e use a tecla de atalho '{}' para copiar, o texto copiado não será traduzido automaticamente

source: warn
pt_br: avisar

source: quit?
pt_br: desistir?

source: Open
pt_br: Abrir

source: Check for updates
pt_br: Verificar atualizações

source: Copy to translate
pt_br: Copiar para traduzir

source: Preferences
pt_br: Preferências

source: Quit
pt_br: Desistir

source: Stop copy to translate
pt_br: Pare de copiar para traduzir

source: New version available!
pt_br: Nova versão disponível!

source: No new version!
pt_br: Nenhuma nova versão!

source: Automatic
pt_br: Automático

source: Chinese
pt_br: Chinês

source: Classical Chinese
pt_br: Chinês Clássico

source: English
pt_br: Inglês

source: Japanese
pt_br: Japonês

source: Korean
pt_br: Coreano

source: German
pt_br: Alemão

source: French
pt_br: Francês

source: Italian
pt_br: Italiano

source: Spanish
pt_br: Espanhol

source: Portuguese(Brazilian)
pt_br: Português (Brasileiro)

source: please input `{sk}` for `{server}` in preference
pt_br: por favor insira `{sk}` para `{server}` na preferência

source: Developers, please set sk_placeholder_text
pt_br: Desenvolvedores, por favor definam o texto do espaço reservado

source: something error: {}
pt_br: algo erro: {}

source: please contact the developer: {}
pt_br: entre em contato com o desenvolvedor: {}

source: 1000 characters limit! You send {len_text} characters.
pt_br: Limite de 1000 caracteres! Você envia {len_text} caracteres.

source: aliyun
pt_br: Aliyu

source: please install python whl (not support flatpak): {}
pt_br: por favor instale python whl (não suporta flatpak): {}

source: Maybe there is probably a problem with the VPN proxy settings: {}
pt_br: Talvez haja um problema com as configurações de proxy da VPN: {}

source: Please copy the configuration data in json format first
pt_br: Copie primeiro os dados de configuração no formato JSON

source: no text
pt_br: sem texto

source: the file does not exist: {}
pt_br: o arquivo não existe: {}

source: Translate, followed by text
pt_br: Traduzir, seguido de texto

source: Recognize image, followed by file path
pt_br: Reconhecer imagem, seguida do caminho do arquivo

source: Which service engine to use, if -s is not entered, help will be provided based on -t or -o
pt_br: Qual mecanismo de serviço usar, se -s não for inserido, a ajuda será fornecida com base em -t ou -o

source: The language to be translated/recognized, if -l is not entered, corresponding help will be provided based on the input of -s
pt_br: O idioma a ser traduzido/reconhecido, se -l não for inserido, a ajuda correspondente será fornecida com base na entrada de -s

source: _Keyboard Shortcuts
pt_br: Atalhos de teclado

source: Translate Server
pt_br: Servidor de tradução

source: setup API Key for translation Server, click on the right to the details
pt_br: configure a chave API para o servidor de tradução, clique à direita para os detalhes

source: local or cloud, text recognition
pt_br: local ou nuvem, reconhecimento de texto

source: Automatically check for updates when opening software
pt_br: Verifique automaticamente se há atualizações ao abrir o software

source: backup/restore the settings to/from the clipboard, edit or backup it
pt_br: fazer backup/restaurar as configurações de/para a área de transferência, editar ou fazer backup

source: Splice the next copied text with the previous text
pt_br: Divida o próximo texto copiado com o texto anterior

# shortcut window
source: Quit
pt_br: Desistir

# shortcut window
source: Show Shortcuts
pt_br: Mostrar atalhos
